Revit 2027 API
MEPAnalyticalConnection.GetFlow Method
 Gets the flow value of this analytical connection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetFlow()
Public Function GetFlow As Double
public:
double GetFlow()
member GetFlow : unit -> float
Return Value
Double
 The flow value.
Remarks
 If the network flow is asynchronously calculated, this method would wait until the calculation is completed. This ensures the returned flow value is always up to date.
See Also
Reference
MEPAnalyticalConnection Class
Autodesk.Revit.DB Namespace